# Pandas Series

In [6]:
import pandas as pd
a1=pd.Series([4,8,3,7])
print(a1)

0    4
1    8
2    3
3    7
dtype: int64

# Pandas Series has Values and Indexes

In [12]:
import pandas as pd
a1=pd.Series([40,80,30,70])
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes RangeIndex(start=0, stop=4, step=1)

0    40
1    80
2    30
3    70
dtype: int64

# Non Numeric Index

In [15]:
a1=pd.Series([40,80,30,70],index=['Jan','Feb','Mar','Apr'])
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

Jan    40
Feb    80
Mar    30
Apr    70
dtype: int64

In [18]:
a1=pd.Series([40,80,30,70],index=['Jan','Feb','Mar','Apr'],name='Generate Random Data') #Adding Name
print('Values',a1.values)
print('Indexes',a1.index)
a1

Values [40 80 30 70]
Indexes Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

Jan    40
Feb    80
Mar    30
Apr    70
Name: Generate Random Data, dtype: int64

In [22]:
a2=pd.Series([10,15,7,18,11,9,0],
             index=['Mon','Tues','Wed','Thurs','Fri','Sat','Sun'],
             name='Canteen weekly data of Switches Sales')
a2

Mon      10
Tues     15
Wed       7
Thurs    18
Fri      11
Sat       9
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

In [23]:
print(a2['Wed'])   #pick data by name and by index
print(a2[2])

7
7

In [28]:
print(a2[[2,4]]) #multipl selection
print(a2[['Sun','Sat']])

Wed     7
Fri    11
Name: Canteen weekly data of Switches Sales, dtype: int64
Sun    0
Sat    9
Name: Canteen weekly data of Switches Sales, dtype: int64

In [30]:
print(a2[a2>10]) #Condition apply

Tues     15
Thurs    18
Fri      11
Name: Canteen weekly data of Switches Sales, dtype: int64

In [32]:
a3=a2*2    #values multiply by 2
print(a2)
a3

Mon      10
Tues     15
Wed       7
Thurs    18
Fri      11
Sat       9
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

Mon      20
Tues     30
Wed      14
Thurs    36
Fri      22
Sat      18
Sun       0
Name: Canteen weekly data of Switches Sales, dtype: int64

In [33]:
a3/2  #we can also perform arithmatic operation

Mon      10.0
Tues     15.0
Wed       7.0
Thurs    18.0
Fri      11.0
Sat       9.0
Sun       0.0
Name: Canteen weekly data of Switches Sales, dtype: float64

In [34]:
'Fri' in a2  #find whether the index is in series or not

True

# Create Panda Series by using array

In [36]:
import numpy as np
val=np.array([3,5,0,7,1])
ind=np.array(['a','b','c','d','e'])
a4=pd.Series(val,index=ind)
a4

a    3
b    5
c    0
d    7
e    1
dtype: int32

# Pandas Series by Dictionary

In [40]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata)
print(a5)
print(a5.index)

Sindh          30000
Punjab         20000
KPK            15000
Balochistan     7000
dtype: int64
Index(['Sindh', 'Punjab', 'KPK', 'Balochistan'], dtype='object')

In [41]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata, index=['Balochistan', 'Sindh','Punjab','KPK'])   #Index Shuffle but data same
print(a5)
print(a5.index)

Balochistan     7000
Sindh          30000
Punjab         20000
KPK            15000
dtype: int64
Index(['Balochistan', 'Sindh', 'Punjab', 'KPK'], dtype='object')

In [45]:
sdata={'Sindh':30000, 'Punjab':20000,'KPK':15000,'Balochistan':7000}
a5=pd.Series(sdata, index=['Balochistan', 'Sindh','Punjab','KPK','Gilgit'])   #Mising data we increased 1 index
print(a5)
print(a5.index)
#print(pd.isnull(a5))  #Check the null values it give true when NaN is available. Null is value which is not present in series
a5.isnull()  #Both commands are same pd.isnull is function and a5.isnull is a method

Balochistan     7000.0
Sindh          30000.0
Punjab         20000.0
KPK            15000.0
Gilgit             NaN
dtype: float64
Index(['Balochistan', 'Sindh', 'Punjab', 'KPK', 'Gilgit'], dtype='object')

Balochistan    False
Sindh          False
Punjab         False
KPK            False
Gilgit          True
dtype: bool

In [48]:
a5.name='Tax paying state'
a5.index.name='State Names'  #update index name
print(a5)

State Names
Balochistan     7000.0
Sindh          30000.0
Punjab         20000.0
KPK            15000.0
Gilgit             NaN
Name: Tax paying state, dtype: float64

In [49]:
a5.index=['B','S','P','K','G']  #Index update
print(a5)

B     7000.0
S    30000.0
P    20000.0
K    15000.0
G        NaN
Name: Tax paying state, dtype: float64

# Pandas DataFrame

In [15]:
import pandas as pd
boy=pd.Series([15,18,25,30],index=['Class I','Class II','Class III','Class IV'])  #length of Both Series Indexes should be the same
girl=pd.Series([13,11,15,20],index=['Class I','Class II','Class III','Class IV'])
data={'No.of Boys':boy,'No.of Girls':girl}
final_data=pd.DataFrame(data)
print(final_data)

           No.of Boys  No.of Girls
Class I            15           13
Class II           18           11
Class III          25           15
Class IV           30           20

In [23]:
data={'Country':['England','China','USA','France','Germany','India','Canada'], 'Year':[2005,2006,2007,2008,2009,2010,2011],
      'Literacy':[75,85.5,95.2,83.7,88.6,90.1,96.2]}
frame=pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th','7th'])
display(frame)

     Country  Year  Literacy
1st  England  2005      75.0
2nd    China  2006      85.5
3rd      USA  2007      95.2
4th   France  2008      83.7
5th  Germany  2009      88.6
6th    India  2010      90.1
7th   Canada  2011      96.2

In [24]:
frame.head() #it print the first five rows of ur data

     Country  Year  Literacy
1st  England  2005      75.0
2nd    China  2006      85.5
3rd      USA  2007      95.2
4th   France  2008      83.7
5th  Germany  2009      88.6

In [25]:
pd.DataFrame(data,columns=['Year','Literacy','Country']) #we can change the position as well

   Year  Literacy  Country
0  2005      75.0  England
1  2006      85.5    China
2  2007      95.2      USA
3  2008      83.7   France
4  2009      88.6  Germany
5  2010      90.1    India
6  2011      96.2   Canada

In [29]:
frame1=pd.DataFrame(data,columns=['Year','Literacy','Country','Economy']) #adding new column
frame1

   Year  Literacy  Country Economy
0  2005      75.0  England     NaN
1  2006      85.5    China     NaN
2  2007      95.2      USA     NaN
3  2008      83.7   France     NaN
4  2009      88.6  Germany     NaN
5  2010      90.1    India     NaN
6  2011      96.2   Canada     NaN

In [31]:
print(frame1.columns)
print(frame1.index)

Index(['Year', 'Literacy', 'Country', 'Economy'], dtype='object')
RangeIndex(start=0, stop=7, step=1)